RoR/radionix/app/views/albums/show.html.erb

  <h1>Songs in this album: </h2>
  <% @album.songs.each do |song| %>
---
SELECT "songs".* FROM "songs" WHERE "songs"."album_id" = ?  [["album_id", 1]]